content/posts/Notions_of_intrinsic_motivation_by_Martin_Biehl_in_2017.md
+++
title = "Notions of intrinsic motivation by Martin Biehl in 2017"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:35:30-04:00
slug = "Notions_of_intrinsic_motivation_by_Martin_Biehl_in_2017"
draft = false
+++

## [intrinsic motivation]({{< relref "intrinsic_motivation" >}}), [lectures]({{< relref "lectures" >}}), [Martin Biehl]({{< relref "Martin_Biehl" >}}) {#intrinsic-motivation--intrinsic-motivation-dot-md--lectures--lectures-dot-md--martin-biehl--martin-biehl-dot-md}


## [Notions of intrinsic motivation \* YouTube](<https://www.youtube.com/watch?v=Op24sHWm008&t=68s>) {#notions-of-intrinsic-motivation-youtube--https-www-dot-youtube-dot-com-watch-v-op24shwm008-and-t-68s}


## This talk can be viewed as a companion to [Expanding the Active Inference Landscape More Intrinsic Motivations in the Perception-Action Loop by Martin Biehl, Daniel Polani, et al in 2018]({{< relref "Expanding_the_Active_Inference_Landscape_More_Intrinsic_Motivations_in_the_Perception-Action_Loop_by_Martin_Biehl,_Daniel_Polani,_et_al_in_2018" >}}) {#this-talk-can-be-viewed-as-a-companion-to-expanding-the-active-inference-landscape-more-intrinsic-motivations-in-the-perception-action-loop-by-martin-biehl-daniel-polani-et-al-in-2018--expanding-the-active-inference-landscape-more-intrinsic-motivations-in-the-perception-action-loop-by-martin-biehl-daniel-polani-et-al-in-2018-dot-md}


## @11:00 oudeyer and Kaplan 2008, berlyne 1965, schmidhuber 2010 {#11-00-oudeyer-and-kaplan-2008-berlyne-1965-schmidhuber-2010}


### "Computational approaches to intrinsic motivations (Oudeyer and Kaplan, 2009; Schmidhuber, 2010; Santucci et al., 2013) can be categorized roughly by the psychological motivations they are imitating, e.g., drives to manipulate and explore, the reduction of cognitive dissonance, the achievement of optimal incongruity, and finally motivations for effectance, personal causation, competence and self-determination." {#computational-approaches-to-intrinsic-motivations--oudeyer-and-kaplan-2009-schmidhuber-2010-santucci-et-al-dot-2013--can-be-categorized-roughly-by-the-psychological-motivations-they-are-imitating-e-dot-g-dot-drives-to-manipulate-and-explore-the-reduction-of-cognitive-dissonance-the-achievement-of-optimal-incongruity-and-finally-motivations-for-effectance-personal-causation-competence-and-self-determination-dot}


## @27:17 Examples {#27-17-examples}


### compression progress {#compression-progress}


### information gain {#information-gain}


### [free energy principle]({{< relref "free_energy_principle" >}}) of [Karl Friston]({{< relref "Karl_Friston" >}}) {#free-energy-principle--free-energy-principle-dot-md--of-karl-friston--karl-friston-dot-md}


### [empowerment maximization]({{< relref "empowerment_maximization" >}}) of [Daniel Polani]({{< relref "Daniel_Polani" >}}) {#empowerment-maximization--empowerment-maximization-dot-md--of-daniel-polani--daniel-polani-dot-md}


### [predictive information maximization]({{< relref "predictive_information_maximization" >}}) of [Naftali Tishby]({{< relref "Naftali_Tishby" >}}) and [William Bialek]({{< relref "William_Bialek" >}}) {#predictive-information-maximization--predictive-information-maximization-dot-md--of-naftali-tishby--naftali-tishby-dot-md--and-william-bialek--william-bialek-dot-md}


##  {#}
